ReachOBack/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("first_name", "last_name", "phone", "email", "confirmed", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    contact = Contact.new(contact_params)
    contact.confirmed = false
    if contact.valid?
      contact.save

SELECT "contacts".* FROM "contacts"
---
  def index
    contacts = Contact.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    contact = Contact.find_by(id: params[:id])
    if contact
      show_contact_hash = {
        id: contact.id,
        first_name: contact.first_name,
        last_name: contact.last_name,
        email: contact.email,
        phone: contact.phone,
        confirmed: contact.confirmed,
        user_id: contact.user_id,
      }

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 1]]
---
  def user_list
    contactList = Contact.where(user_id: params[:id])