app/controllers/mood_updates_controller.rb

  def create
    uid = params[:uid]

    if User.exists?(uid: uid, provider: params[:provider])
      user = User.find_by(uid: uid, provider: params[:provider])

      if MoodLog.exists?(user_id: user.id)
        mood_log = MoodLog.find_by(user_id: user.id)
        mood_update = MoodUpdate.new(primary_mood: params[:primary_mood], intensity: params[:intensity], mood_log_id: mood_log.id)

        if mood_update.valid?

          if mood_update.is_severe?
            mood_update.severe = true
            mood_update.moderate = false
          elsif mood_update.is_moderate?
            mood_update.moderate = true
            mood_update.severe = false
          else
            mood_update.moderate = false
            mood_update.severe = false
          end

          if mood_update.save

            log = MoodLog.find(mood_log.id)
            log.update_log
---
INSERT INTO "mood_updates" ("primary_mood", "intensity", "mood_log_id", "created_at", "updated_at", "severe", "moderate") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["primary_mood", -5], ["intensity", 6], ["mood_log_id", 1], ["created_at", "2018-07-03 18:50:07.028179"], ["updated_at", "2018-07-03 18:50:07.028179"], ["severe", "f"], ["moderate", "t"]]
SELECT  "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "mood_updates".* FROM "mood_updates" WHERE (created_at > '2018-06-30 18:50:07.053669' AND mood_log_id = 1)
UPDATE "mood_logs" SET "recent_severe" = $1, "recent_moderate" = $2, "updated_at" = $3 WHERE "mood_logs"."id" = $4  [["recent_severe", 0], ["recent_moderate", 2], ["updated_at", "2018-07-03 18:50:07.147309"], ["id", 1]]