app/controllers/mood_logs_controller.rb

SELECT  "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "mood_updates".* FROM "mood_updates" WHERE "mood_updates"."mood_log_id" = $1  [["mood_log_id", 1]]
---
  def show
    mood_log = MoodLog.find_by(id: params[:id])
    if mood_log
      updates = MoodUpdate.where(mood_log_id: mood_log.id)