app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username = 'user' AND password = 'password')
---
  def auth
    user = User.where("username = ? AND password = ?", params[:username], params[:password])

INSERT INTO "users" ("first_name", "email", "phone", "age", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "mood_logs" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2018-06-29 20:27:02.276731"], ["updated_at", "2018-06-29 20:27:02.276731"]]
UPDATE "users" SET "updated_at" = $1, "log_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-07-10 21:25:36.276897"], ["log_id", 21], ["id", 21]]
---
  def create
    user = User.create(user_params)

    if user.valid?
      ##  when a new user is created, corresponding moodlog is also created
      new_log = user.create_moodlog
      user.log_id = new_log
      user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "phone" = $3, "email" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "newbie"], ["last_name", "new"], ["phone", "\"232-232-2322\""], ["email", "ssafasfb@email.web"], ["updated_at", "2018-06-30 23:56:43.255018"], ["id", 2]]
---
  def update
    user = User.find_by(id: params[:id])
    if !user.nil?
      if user.update(user_params)

SELECT "users".* FROM "users"
---
  def index
    users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: params[:id])